Repository: yuki-kimoto/mojolicious-guides-japanese
Catalog: Mojo-OmegaT-omegat.tmx
Source language: en
Languages: ja

source: L<Mojolicious::Command::version> inherits all methods from L<Mojolicious::Command> and implements the following new ones.
ja: [[Mojolicious::Command::version]] inherits all methods from [[Mojolicious::Command]] and implements the following new ones.

source: L<Mojolicious::Command::version> shows version information for available core and optional modules.
ja: [[Mojolicious::Command::version]] shows version information for available core and optional modules.

source: L<Mojolicious::Command> implements the following attributes.
ja: [[Mojolicious::Command]] implements the following attributes.

source: L<Mojolicious::Command> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojolicious::Command]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojolicious::Command> is an abstract base class for L<Mojolicious> commands.
ja: [[Mojolicious::Command]] is an abstract base class for [[Mojolicious]] commands.

source: L<Mojolicious::Commands> inherits all attributes from L<Mojolicious::Command> and implements the following new ones.
ja: [[Mojolicious::Commands]] inherits all attributes from [[Mojolicious::Command]] and implements the following new ones.

source: L<Mojolicious::Commands> inherits all methods from L<Mojolicious::Command> and implements the following new ones.
ja: [[Mojolicious::Commands]] inherits all methods from [[Mojolicious::Command]] and implements the following new ones.

source: L<Mojolicious::Commands> is the interactive command line interface for the L<Mojolicious> framework.
ja: [[Mojolicious::Commands]] is the interactive command line interface for the [[Mojolicious]] framework.

source: L<Mojolicious::Controller/"req"> and L<Mojolicious::Controller/"res"> give you full access to all HTTP features and information.
ja: [[Mojolicious::Controller]]のC<req>と[[Mojolicious::Controller]]のC<res> を使って、HTTPの機能と情報のすべてに完全にアクセスすることができます。

source: L<Mojolicious::Controller> implements the following attributes.
ja: [[Mojolicious::Controller]] implements the following attributes.

source: L<Mojolicious::Controller> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojolicious::Controller]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojolicious::Controller> is the base class for your L<Mojolicious> controllers.
ja: [[Mojolicious::Controller]] is the base class for your [[Mojolicious]] controllers.

source: L<Mojolicious::Lite> implements the following functions, which are automatically exported.
ja: [[Mojolicious::Lite]] implements the following functions, which are automatically exported.

source: L<Mojolicious::Lite> inherits all attributes from L<Mojolicious>.
ja: [[Mojolicious::Lite]] inherits all attributes from [[Mojolicious]].

source: L<Mojolicious::Lite> inherits all methods from L<Mojolicious>.
ja: [[Mojolicious::Lite]] inherits all methods from [[Mojolicious]].

source: L<Mojolicious::Lite> is a tiny domain specific language built around L<Mojolicious>, made up of only about a dozen Perl functions.
ja: [[Mojolicious::Lite]] is a tiny domain specific language built around [[Mojolicious]], made up of only about a dozen Perl functions.

source: L<Mojolicious::Plugin::Config> inherits all methods from L<Mojolicious::Plugin> and implements the following new ones.
ja: [[Mojolicious::Plugin::Config]] inherits all methods from [[Mojolicious::Plugin]] and implements the following new ones.

source: L<Mojolicious::Plugin::Config> is a Perl-ish configuration plugin.
ja: [[Mojolicious::Plugin::Config]] is a Perl-ish configuration plugin.

source: L<Mojolicious::Plugin::Config> supports the following options.
ja: [[Mojolicious::Plugin::Config]] supports the following options.

source: L<Mojolicious::Plugin::DefaultHelpers> implements the following helpers.
ja: [[Mojolicious::Plugin::DefaultHelpers]] implements the following helpers.

source: L<Mojolicious::Plugin::DefaultHelpers> inherits all methods from L<Mojolicious::Plugin> and implements the following new ones.
ja: [[Mojolicious::Plugin::DefaultHelpers]] inherits all methods from [[Mojolicious::Plugin]] and implements the following new ones.

source: L<Mojolicious::Plugin::DefaultHelpers> is a collection of helpers for L<Mojolicious>.
ja: [[Mojolicious::Plugin::DefaultHelpers]] is a collection of helpers for [[Mojolicious]].

source: L<Mojolicious::Plugin::EPLRenderer> inherits all methods from L<Mojolicious::Plugin> and implements the following new ones.
ja: [[Mojolicious::Plugin::EPLRenderer]] inherits all methods from [[Mojolicious::Plugin]] and implements the following new ones.

source: L<Mojolicious::Plugin::EPLRenderer> is a renderer for C<epl> templates, which are pretty much just raw L<Mojo::Template>.
ja: [[Mojolicious::Plugin::EPLRenderer]] is a renderer for C<epl> templates, which are pretty much just raw [[Mojo::Template]].

source: L<Mojolicious::Plugin::EPRenderer> inherits all methods from L<Mojolicious::Plugin::EPLRenderer> and implements the following new ones.
ja: [[Mojolicious::Plugin::EPRenderer]] inherits all methods from [[Mojolicious::Plugin::EPLRenderer]] and implements the following new ones.

source: L<Mojolicious::Plugin::EPRenderer> is a renderer for Embedded Perl templates.
ja: [[Mojolicious::Plugin::EPRenderer]] is a renderer for Embedded Perl templates.

source: L<Mojolicious::Plugin::EPRenderer> supports the following options.
ja: [[Mojolicious::Plugin::EPRenderer]] supports the following options.

source: L<Mojolicious::Plugin::HeaderCondition> inherits all methods from L<Mojolicious::Plugin> and implements the following new ones.
ja: [[Mojolicious::Plugin::HeaderCondition]] inherits all methods from [[Mojolicious::Plugin]] and implements the following new ones.

source: L<Mojolicious::Plugin::HeaderCondition> is a route condition for header-based routes.
ja: [[Mojolicious::Plugin::HeaderCondition]] is a route condition for header-based routes.

source: L<Mojolicious::Plugin::JSONConfig> inherits all methods from L<Mojolicious::Plugin::Config> and implements the following new ones.
ja: [[Mojolicious::Plugin::JSONConfig]] inherits all methods from [[Mojolicious::Plugin::Config]] and implements the following new ones.

source: L<Mojolicious::Plugin::JSONConfig> inherits all options from L<Mojolicious::Plugin::Config> and supports the following new ones.
ja: [[Mojolicious::Plugin::JSONConfig]] inherits all options from [[Mojolicious::Plugin::Config]] and supports the following new ones.

source: L<Mojolicious::Plugin::JSONConfig> is a JSON configuration plugin that preprocesses its input with L<Mojo::Template>.
ja: [[Mojolicious::Plugin::JSONConfig]] is a JSON configuration plugin that preprocesses its input with [[Mojo::Template]].

source: L<Mojolicious::Plugin::Mount> inherits all methods from L<Mojolicious::Plugin> and implements the following new ones.
ja: [[Mojolicious::Plugin::Mount]] inherits all methods from [[Mojolicious::Plugin]] and implements the following new ones.

source: L<Mojolicious::Plugin::Mount> is a plugin that allows you to mount whole L<Mojolicious> applications.
ja: [[Mojolicious::Plugin::Mount]] is a plugin that allows you to mount whole [[Mojolicious]] applications.

source: L<Mojolicious::Plugin::TagHelpers> implements the following helpers.
ja: [[Mojolicious::Plugin::TagHelpers]] implements the following helpers.

source: L<Mojolicious::Plugin::TagHelpers> inherits all methods from L<Mojolicious::Plugin> and implements the following new ones.
ja: [[Mojolicious::Plugin::TagHelpers]] inherits all methods from [[Mojolicious::Plugin]] and implements the following new ones.

source: L<Mojolicious::Plugin::TagHelpers> is a collection of HTML tag helpers for L<Mojolicious>, based on the L<HTML Living Standard|https://html.spec.whatwg.org>.
ja: [[Mojolicious::Plugin::TagHelpers]] is a collection of HTML tag helpers for [[Mojolicious]], based on the [[HTML Living Standard|https://html.spec.whatwg.org]].

source: L<Mojolicious::Plugin> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojolicious::Plugin]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojolicious::Plugin> is an abstract base class for L<Mojolicious> plugins.
ja: [[Mojolicious::Plugin]] is an abstract base class for [[Mojolicious]] plugins.

source: L<Mojolicious::Plugins> implements the following attributes.
ja: [[Mojolicious::Plugins]] implements the following attributes.

source: L<Mojolicious::Plugins> inherits all events from L<Mojo::EventEmitter>.
ja: [[Mojolicious::Plugins]] inherits all events from [[Mojo::EventEmitter]].

source: L<Mojolicious::Plugins> inherits all methods from L<Mojo::EventEmitter> and implements the following new ones.
ja: [[Mojolicious::Plugins]] inherits all methods from [[Mojo::EventEmitter]] and implements the following new ones.

source: L<Mojolicious::Plugins> is the plugin manager of L<Mojolicious>.
ja: [[Mojolicious::Plugins]] is the plugin manager of [[Mojolicious]].

source: L<Mojolicious::Renderer> implements the following attributes.
ja: [[Mojolicious::Renderer]] implements the following attributes.

source: L<Mojolicious::Renderer> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojolicious::Renderer]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojolicious::Renderer> is the standard L<Mojolicious> renderer.
ja: [[Mojolicious::Renderer]] is the standard [[Mojolicious]] renderer.

source: L<Mojolicious::Routes::Match> finds routes in L<Mojolicious::Routes> structures.
ja: [[Mojolicious::Routes::Match]] finds routes in [[Mojolicious::Routes]] structures.

source: L<Mojolicious::Routes::Match> implements the following attributes.
ja: [[Mojolicious::Routes::Match]] implements the following attributes.

source: L<Mojolicious::Routes::Match> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojolicious::Routes::Match]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojolicious::Routes::Pattern> implements the following attributes.
ja: [[Mojolicious::Routes::Pattern]] implements the following attributes.

source: L<Mojolicious::Routes::Pattern> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojolicious::Routes::Pattern]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojolicious::Routes::Pattern> is the core of L<Mojolicious::Routes>.
ja: [[Mojolicious::Routes::Pattern]] is the core of [[Mojolicious::Routes]].

source: L<Mojolicious::Routes::Route> implements the following attributes.
ja: [[Mojolicious::Routes::Route]] implements the following attributes.

source: L<Mojolicious::Routes::Route> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojolicious::Routes::Route]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojolicious::Routes::Route> is the route container used by L<Mojolicious::Routes>.
ja: [[Mojolicious::Routes::Route]] is the route container used by [[Mojolicious::Routes]].

source: L<Mojolicious::Routes> inherits all attributes from L<Mojolicious::Routes::Route> and implements the following new ones.
ja: [[Mojolicious::Routes]] inherits all attributes from [[Mojolicious::Routes::Route]] and implements the following new ones.

source: L<Mojolicious::Routes> inherits all methods from L<Mojolicious::Routes::Route> and implements the following new ones.
ja: [[Mojolicious::Routes]] inherits all methods from [[Mojolicious::Routes::Route]] and implements the following new ones.

source: L<Mojolicious::Routes> is the core of the L<Mojolicious> web framework.
ja: [[Mojolicious::Routes]] is the core of the [[Mojolicious]] web framework.

source: L<Mojolicious::Sessions> implements the following attributes.
ja: [[Mojolicious::Sessions]] implements the following attributes.

source: L<Mojolicious::Sessions> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojolicious::Sessions]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojolicious::Sessions> manages sessions based on signed cookies for L<Mojolicious>.
ja: [[Mojolicious::Sessions]] manages sessions based on signed cookies for [[Mojolicious]].

source: L<Mojolicious::Static> implements the following attributes.
ja: [[Mojolicious::Static]] implements the following attributes.

source: L<Mojolicious::Static> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojolicious::Static]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojolicious::Static> is a static file server with C<Range>, C<If-Modified-Since> and C<If-None-Match> support, based on L<RFC 7232|http://tools.ietf.org/html/rfc7232> and L<RFC 7233|http://tools.ietf.org/html/rfc7233>.
ja: [[Mojolicious::Static]] is a static file server with C<Range>, C<If-Modified-Since> and C<If-None-Match> support, based on [[RFC 7232|http://tools.ietf.org/html/rfc7232]] and [[RFC 7233|http://tools.ietf.org/html/rfc7233]].

source: L<Mojolicious::Types> implements the following attributes.
ja: [[Mojolicious::Types]] implements the following attributes.

source: L<Mojolicious::Types> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojolicious::Types]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojolicious::Types> manages MIME types for L<Mojolicious>.
ja: [[Mojolicious::Types]] manages MIME types for [[Mojolicious]].

source: L<Mojolicious::Validator::Validation> implements the following attributes.
ja: [[Mojolicious::Validator::Validation]] implements the following attributes.

source: L<Mojolicious::Validator::Validation> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojolicious::Validator::Validation]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojolicious::Validator::Validation> performs L<Mojolicious::Validator> validation checks.
ja: [[Mojolicious::Validator::Validation]] performs [[Mojolicious::Validator]] validation checks.

source: L<Mojolicious::Validator> implements the following attributes.
ja: [[Mojolicious::Validator]] implements the following attributes.

source: L<Mojolicious::Validator> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojolicious::Validator]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojolicious::Validator> object this validation belongs to.
ja: [[Mojolicious::Validator]] object this validation belongs to.

source: L<Mojolicious::Validator> validates values for L<Mojolicious>.
ja: [[Mojolicious::Validator]] validates values for [[Mojolicious]].

source: L<Mojolicious> and L<Mojolicious::Lite> are the sum of many parts, built on top of the L<Mojo> web development toolkit.
ja: [[Mojolicious]] and [[Mojolicious::Lite]] are the sum of many parts, built on top of the [[Mojo]] web development toolkit.

source: L<Mojolicious> applications are ridiculously simple to deploy with L<Plack>, but be aware that many real-time web features, such as WebSockets, are not available.
ja: [[Mojolicious]] applications are ridiculously simple to deploy with [[Plack]], but be aware that many real-time web features, such as WebSockets, are not available.

source: L<Mojolicious> contains a very portable non-blocking I/O HTTP and WebSocket server with L<Mojo::Server::Daemon>.
ja: [[Mojolicious]] contains a very portable non-blocking I/O HTTP and WebSocket server with [[Mojo::Server::Daemon]].

source: L<Mojolicious> contains a very sophisticated event system based on L<Mojo::EventEmitter>, with ready-to-use events on almost all layers, and which can be combined to solve some of the hardest problems in web development.
ja: [[Mojolicious]] contains a very sophisticated event system based on [[Mojo::EventEmitter]], with ready-to-use events on almost all layers, and which can be combined to solve some of the hardest problems in web development.

source: L<Mojolicious> follows this model and fully supports these two release series.
ja: [[Mojolicious]] follows this model and fully supports these two release series.

source: L<Mojolicious> has been designed from the ground up for non-blocking I/O and event loops.
ja: [[Mojolicious]] has been designed from the ground up for non-blocking I/O and event loops.

source: L<Mojolicious> implements the following attributes.
ja: [[Mojolicious]] implements the following attributes.

source: L<Mojolicious> includes a minimalistic but very powerful template system out of the box called Embedded Perl or C<ep> for short.
ja: [[Mojolicious]] includes a minimalistic but very powerful template system out of the box called Embedded Perl or C<ep> for short.

source: L<Mojolicious> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojolicious]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojolicious> is open source and free to use.
ja: [[Mojolicious]] is open source and free to use.

source: L<Mojolicious> loves JSON and comes with the possibly fastest pure-Perl implementation L<Mojo::JSON> built right in, which is accessible through L<Mojo::Message/"json"> as well as the reserved stash value C<json>.
ja: [[Mojolicious]]はJSONが大好きです。ピュアPerlの実装ではおそらく最速の [[Mojo::JSON]] が組み込まれており、[[Mojo::Message]]のC<json> または予約済みスタッシュ値のC<json>によってアクセスできます。

source: L<Mojolicious> uses a modern subset of Perl exclusively, and therefore all documentation assumes that L<strict>, L<warnings>, L and Perl 5.10 L<features|feature> are enabled, even if examples don't specifically mention it.
ja: [[Mojolicious]] uses a modern subset of Perl exclusively, and therefore all documentation assumes that [[strict]], [[warnings]], [[utf8]] and Perl 5.10 [[features|feature]] are enabled, even if examples don't specifically mention it.

source: L<Mojolicious> uses many environment variables both internally and externally, notably (but not exclusively) those starting with the prefix C<MOJO_*> and C<PLACK_ENV>.
ja: [[Mojolicious]] uses many environment variables both internally and externally, notably (but not exclusively) those starting with the prefix C<MOJO_*> and C<PLACK_ENV>.

source: L<Mojolicious> uses secret passphrases for security features such as signed cookies.
ja: [[Mojolicious]] uses secret passphrases for security features such as signed cookies.

source: L<Mojolicious> will emit the following hooks in the listed order.
ja: [[Mojolicious]] will emit the following hooks in the listed order.

source: L<Mojolicious>, L<Mojolicious::Guides>, L<https://mojolicious.org>.
ja: [[Mojolicious]], [[Mojolicious::Guides]], [[https://mojolicious.org]].

source: L<PSGI> and L<Plack> are inspired by Python's WSGI and Ruby's Rack.
ja: [[PSGI]] and [[Plack]] are inspired by Python's WSGI and Ruby's Rack.

source: L<PSGI> is an interface between Perl web frameworks and web servers, and L<Plack> is a Perl module and toolkit that contains L<PSGI> middleware, helpers and adapters to web servers.
ja: [[PSGI]] is an interface between Perl web frameworks and web servers, and [[Plack]] is a Perl module and toolkit that contains [[PSGI]] middleware, helpers and adapters to web servers.

source: L<Plack> provides many server and protocol adapters for you to choose from, such as C<FCGI>, C<uWSGI> and C<mod_perl>.
ja: [[Plack]] provides many server and protocol adapters for you to choose from, such as C<FCGI>, C<uWSGI> and C<mod_perl>.

source: L<Stix|https://stix.no> sponsored the creation of the Mojolicious logo (designed by Nicolai Graesdal) and transferred its copyright to Sebastian Riedel.
ja: [[Stix|https://stix.no]] sponsored the creation of the Mojolicious logo (designed by Nicolai Graesdal) and transferred its copyright to Sebastian Riedel.

source: L<Test::Mojo> allows us to inspect and make assertions about HTTP response headers.
ja: [[Test::Mojo]] allows us to inspect and make assertions about HTTP response headers.

source: L<Test::Mojo> also exposes a rich set of assertions for testing the body of a response, whether that body be HTML, plain-text, or JSON.
ja: [[Test::Mojo]] also exposes a rich set of assertions for testing the body of a response, whether that body be HTML, plain-text, or JSON.

source: L<Test::Mojo> can be thought of as a module that provides all of the tools and testing assertions needed to test web applications in a Perl-ish way.
ja: [[Test::Mojo]] can be thought of as a module that provides all of the tools and testing assertions needed to test web applications in a Perl-ish way.

source: L<Test::Mojo> exposes the entire transaction object so you can get all the data you need from a response:
ja: [[Test::Mojo]] exposes the entire transaction object so you can get all the data you need from a response:

source: L<Test::Mojo> has a L<Mojo::UserAgent> object that allows it to make HTTP requests and check for HTTP transport errors.
ja: [[Test::Mojo]] has a [[Mojo::UserAgent]] object that allows it to make HTTP requests and check for HTTP transport errors.

source: L<Test::Mojo> has a lot of handy shortcuts built into it to make testing L<Mojolicious> or L<Mojolicious::Lite> applications enjoyable.
ja: [[Test::Mojo]] has a lot of handy shortcuts built into it to make testing [[Mojolicious]] or [[Mojolicious::Lite]] applications enjoyable.

source: L<Test::Mojo> has access to the application object, which allows us to invoke helpers from our test file:
ja: [[Test::Mojo]] has access to the application object, which allows us to invoke helpers from our test file:

source: L<Test::Mojo> implements the following attributes.
ja: [[Test::Mojo]] implements the following attributes.

source: L<Test::Mojo> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Test::Mojo]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Test::Mojo> is a scriptable HTTP user agent designed specifically for testing, with many fun state of the art features such as CSS selectors based on L<Mojo::DOM>.
ja: [[Test::Mojo]] is a scriptable HTTP user agent designed specifically for testing, with many fun state of the art features such as CSS selectors based on [[Mojo::DOM]].

source: L<Test::Mojo> is a test user agent based on L<Mojo::UserAgent>, it is usually used together with L<Test::More> to test L<Mojolicious> applications.
ja: [[Test::Mojo]] is a test user agent based on [[Mojo::UserAgent]], it is usually used together with [[Test::More]] to test [[Mojolicious]] applications.

source: L<Test::Mojo> provides assertions to test almost every aspect of the HTTP response, including the HTTP response status code, the value of the C<Content-Type> header, and other arbitrary HTTP header information.
ja: [[Test::Mojo]] provides assertions to test almost every aspect of the HTTP response, including the HTTP response status code, the value of the C<Content-Type> header, and other arbitrary HTTP header information.

source: L<Test::Mojo> supplies additional test assertions organized around the web application request/response transaction (transport, response headers, response bodies, etc.), and WebSocket communications.
ja: [[Test::Mojo]] supplies additional test assertions organized around the web application request/response transaction (transport, response headers, response bodies, etc.), and WebSocket communications.
